index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Shiwali Mohan</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Shiwali Mohan"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-26 16:07:41 EDT"/>
<meta name="author" content="Shiwali Mohan"/>
<meta name="description" content="Shiwali's personal website"/>
<meta name="keywords" content=""/>
<link href='http://fonts.googleapis.com/css?family=Esteban|Gentium+Book+Basic' rel='stylesheet' type='text/css'>
<link href='http://fonts.googleapis.com/css?family=Vollkorn' rel='stylesheet' type='text/css'>
<LINK href="css/stylesheet.css" rel="stylesheet" type="text/css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Shiwali Mohan</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">About</h2>
<div class="outline-text-2" id="text-1">


<p>
I am a doctoral candidate in <a href="http://www.cse.umich.edu/">Computer Science and Engineering</a> at <a href="http://www.umich.edu/">The University of Michigan</a>, Ann Arbor. I have been working with Professor <a href="http://ai.eecs.umich.edu/people/laird/">John Laird</a>
on the <a href="http://sitemaker.umich.edu/soar/home">Soar Cognitive Architecture</a> in the <a href="http://www.eecs.umich.edu/ai/">Michigan AI Lab</a> since 2009.
</p>
<p>
I am interested in situated language for intelligent agents and the
relationship of language processing (comprehension, acquisition,
generation and interaction) with other cognitive capabilities such as
perception, procedural and declarative knowledge, and learning. 
</p>
<p>
My past work has focused on cognitive agents that can learn to
navigate new, complex environments. We have looked at agents that
start with minimal background knowledge about an environment and build
relevant, relational structures using reinforcement learning in the
<a href="http://2009.rl-competition.org/mario.php">Infinite Mario</a> RL domain.
</p>
<p>
I am from India, where I received an undergraduate degree in
<a href="http://en.wikipedia.org/wiki/Instrumentation">Instrumentation and Control Engineering</a> from <a href="http://www.du.ac.in/index.php?id=4">University of Delhi</a>. After four years of struggling with control equations and
differential calculus, I ended up loving programming and other geeky,
Computer Science-y things. I worked with <a href="http://in.careers.yahoo.com/">Yahoo! India</a> as a software
engineer on their Strategic Data Solutions team for some time, before
deciding to denounce the real world, and the money that comes with it
and became a graduate student.
</p>

<hr/>
<p>
I am available at shiwali.at.umich.dot.edu and
shiwali.dot.mohan.at.gmail.dot.com. My curriculum vitae dated
26-10-2012 is <a href="resume/resume.pdf">here</a>. My google citation page is <a href="http://scholar.google.com/citations?hl=en&amp;user=EYWzxPIAAAAJ">here</a>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Research</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-4">
<h4 id="sec-2-1">Grounded Natural Language</h4>
<div class="outline-text-4" id="text-2-1">

<p>I am involved with the grounded language acquisition project
at Michigan. Apart from the Soar group at University of Michigan, the
team also includes <a href="http://april.eecs.umich.edu/">APRIL at Michigan</a> and <a href="http://www.soartech.com/">SoarTech</a>.
</p>
<p>
I am currently studying comprehension of sentences by exploiting
non-linguistic context such as perceptual information, procedural
knowledge and semantic information.
</p>
<p>
I have designed and implemented an interaction model for agents
instantiated in Soar cognitive architecture that allows limited
mixed-initiative interaction with an instructor. The
agents can then derive generally applicable procedural knowledge from
a history of interactions (available in episodic/semantic memory of
the agent) using situated explanation. 
</p>
<p>
Related Software: <a href="https://github.com/mtinkerhess/sbolt">SBOLT</a>, <a href="https://github.com/shiwalimohan/bolt-agents">Soar Agents</a>, <a href="http://code.google.com/p/soar/">Soar</a>

</p>
<hr/>
</div>

</div>

<div id="outline-container-2-2" class="outline-4">
<h4 id="sec-2-2">Reinforcement Learning</h4>
<div class="outline-text-4" id="text-2-2">

<p>In the past, I was investigating the capabilities of Soar-RL in
complex environments. I designed, implemented and analyzed
reinforcement learning agents for Infinite Mario. I also implemented modular
reinforcement learning for Soar cognitive architecture that allows the
agent to learn multiple MDPs at the same time.
</p>
<p>
Related Software:
<a href="https://github.com/shiwalimohan/MarioSoar">MarioSoar</a>
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Academia</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-4">
<h4 id="sec-3-1">Teaching</h4>
<div class="outline-text-4" id="text-3-1">

<p>I served as a graduate student instructor for EECS 492 - Introduction
to Artificial Intelligence in Winter 2012 at University of Michigan.<br/>
Course material: <a href="https://github.com/shiwalimohan/eecs492UM/zipball/master">zip archive</a> | <a href="https://github.com/shiwalimohan/eecs492UM">github</a>

</p>
<hr/>
</div>

</div>

<div id="outline-container-3-2" class="outline-4">
<h4 id="sec-3-2">Advising</h4>
<div class="outline-text-4" id="text-3-2">

<p>I am a founding member of the <a href="http://www.edulix.com/forum/forumdisplay.php?fid=105">EduMentoring</a> initiative - a bunch of
graduate students who volunteer as undergraduate research mentors to
students in India.<br/>
<br/>
Fall 2012, Winter 2013: Advising <a href="#mittal.anant-gmail.com">Anant Mittal</a>, <a href="#anmol.gupta91-gmail.com">Anmol Gupta</a> on
designing Soar AI agents for Google AI Challenge - Planet Wars. The
work is to be submitted as a minor project to the CS department,
<a href="http://www.bvcoend.ac.in//">BVCOE</a>, New Delhi, India.<br/>
<br/>
Fall 2011, Winter 2012: Advised <a href="#mandarjoshi.90-gmail.com">Mandar Joshi</a>, <a href="#khobragade.rakesh-gmail.com">Rakesh Khobragade</a>,
<a href="#sonusaurabhsarda-gmail.com">Saurabh Sarda</a> on designing Reinforcement Learning agents for Infinite
Mario. The work was submitted as final year thesis project to the CS
department, <a href="http://www.vnit.ac.in/">VNIT</a>, Nagpur, India.
</p>

<hr/>
</div>

</div>

<div id="outline-container-3-3" class="outline-4">
<h4 id="sec-3-3">Service</h4>
<div class="outline-text-4" id="text-3-3">

<p>Co-chair, Special Interest Group on Faculty (<a href="https://wiki.eecs.umich.edu/sigfaculty/index.php/Main_Page">SIG-Faculty</a>) at
University of Michigan. 2012.<br/>
Vice-President, Computer Science and Engineering Graduate student
organization (<a href="http://cseg.eecs.umich.edu/">CSEG</a>) at University of Michigan. 2011. <br/>
Creative Lead, Indian Students Association (<a href="#umisa.org">ISA</a>) at University of Michigan. 2011<br/>
DCO Representative, Computer Science and Engineering Graduate student
organization (<a href="http://cseg.eecs.umich.edu/">CSEG</a>) at University of Michigan. 2010.
Social Chair, Indian Students Association (<a href="#umisa.org">ISA</a>) at University of
Michigan. 2010<br/>

</p>
<hr/>
</div>

</div>
