index.org
*** Talks
[[http://shiwali.me/content/interaction.pdf][Mixed-Initiative Interaction for Learning with Instruction]],
32nd Soar Workshop, June 2012, Ann Arbor, Michigan\\
[[http://shiwali.me/content/comprehension.pdf][Situated Comprehension of Action Commands]],
32nd Soar Workshop, June 2012, Ann Arbor, Michigan\\
[[http://shiwali.me/content/verb-learning.pdf][Learning New Verbs with Retrospective Projection]],
32nd Soar Workshop, June 2012, Ann Arbor, Michigan\\
[[http://ai.eecs.umich.edu/soar/sitemaker/workshop/31/files/27_mohan1_modular.pdf][Modular Reinforcement Learning In Soar]], 
31st Soar Workshop, June 2011, Ann Arbor, Michigan \\
[[http://ai.eecs.umich.edu/soar/sitemaker/workshop/31/files/35_mohan2_architecture.pdf][Towards an Architecture for Learning with Instruction]], 
31st Soar Workshop, June 2011, Ann Arbor Michigan \\
[[http://ai.eecs.umich.edu/soar/sitemaker/workshop/30/mohan1.pdf][Reinforcement Learning in Infinite Mario]], 
30th Soar Workshop, June 2010, Ann Arbor, Michigan \\
[[http://ai.eecs.umich.edu/soar/sitemaker/workshop/30/mohan2.pdf][Learning Background Knowledge through Instruction]], 
30th Soar Workshop, June 2010, Ann Arbor, Michigan \\
[[http://sitemaker.umich.edu/soar/files/mohan.pdf][Learning to Play Mario]], 
29th Soar Workshop, June 2009, Ann Arbor, Michigan \\
-------
*** Miscellaneous Projects
[[file:content/mohan_EECS545.pdf][On Generating Grounded Language in Cognitive Architecture]], 
EECS 590, Natural Language Processing, April 2011, University of Michigan\\
[[file:content/prelim-paper.pdf][Relational Reinforcement Learning in Infinite Mario]], 
Preliminary Examination, September 2010, University of Michigan \\
[[file:content/MohanPillaiSleight.pdf][Classification of Executed and Imagined Motor Movement EEG Signals]],
EECS 545, Machine Learning, December 2009, University of Michigan\\
[[file:content/hadoop.pdf][Towards a Resource Aware Scheduler in Hadoop]],
EECS 589, Advanced Computer Networks, December 2009, University of
Michigan
