index.html

<div id="outline-container-3-4" class="outline-4">
<h4 id="sec-3-4">Talks</h4>
<div class="outline-text-4" id="text-3-4">

<p><a href="http://shiwali.me/content/interaction.pdf">Mixed-Initiative Interaction for Learning with Instruction</a>,
32nd Soar Workshop, June 2012, Ann Arbor, Michigan<br/>
<a href="http://shiwali.me/content/comprehension.pdf">Situated Comprehension of Action Commands</a>,
32nd Soar Workshop, June 2012, Ann Arbor, Michigan<br/>
<a href="http://shiwali.me/content/verb-learning.pdf">Learning New Verbs with Retrospective Projection</a>,
32nd Soar Workshop, June 2012, Ann Arbor, Michigan<br/>
<a href="http://ai.eecs.umich.edu/soar/sitemaker/workshop/31/files/27_mohan1_modular.pdf">Modular Reinforcement Learning In Soar</a>, 
31st Soar Workshop, June 2011, Ann Arbor, Michigan <br/>
<a href="http://ai.eecs.umich.edu/soar/sitemaker/workshop/31/files/35_mohan2_architecture.pdf">Towards an Architecture for Learning with Instruction</a>, 
31st Soar Workshop, June 2011, Ann Arbor Michigan <br/>
<a href="http://ai.eecs.umich.edu/soar/sitemaker/workshop/30/mohan1.pdf">Reinforcement Learning in Infinite Mario</a>, 
30th Soar Workshop, June 2010, Ann Arbor, Michigan <br/>
<a href="http://ai.eecs.umich.edu/soar/sitemaker/workshop/30/mohan2.pdf">Learning Background Knowledge through Instruction</a>, 
30th Soar Workshop, June 2010, Ann Arbor, Michigan <br/>
<a href="http://sitemaker.umich.edu/soar/files/mohan.pdf">Learning to Play Mario</a>, 
29th Soar Workshop, June 2009, Ann Arbor, Michigan <br/>

</p>
<hr/>
</div>

</div>

<div id="outline-container-3-5" class="outline-4">
<h4 id="sec-3-5">Miscellaneous Projects</h4>
<div class="outline-text-4" id="text-3-5">

<p><a href="content/mohan_EECS545.pdf">On Generating Grounded Language in Cognitive Architecture</a>, 
EECS 590, Natural Language Processing, April 2011, University of Michigan<br/>
<a href="content/prelim-paper.pdf">Relational Reinforcement Learning in Infinite Mario</a>, 
Preliminary Examination, September 2010, University of Michigan <br/>
<a href="content/MohanPillaiSleight.pdf">Classification of Executed and Imagined Motor Movement EEG Signals</a>,
EECS 545, Machine Learning, December 2009, University of Michigan<br/>
<a href="content/hadoop.pdf">Towards a Resource Aware Scheduler in Hadoop</a>,
EECS 589, Advanced Computer Networks, December 2009, University of
Michigan
</p></div>
</div>

</div>
